<!doctype html public "-//w3c//dtd html 4.0 transitional//en">
<html>
<head>
   <meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
   <meta name="GENERATOR" content="Mozilla/4.6 [en] (WinNT; I) [Netscape]">
   <title>Programmation en C - FEEDBACK &amp; COPYRIGHT</title>
<!-- This document was created from RTF source by rtftohtml version 3.0.1 -->
<link rel="Stylesheet" href="./site.css" type="text/css">
</head>
<body>
<a href="prg-c03.htm"><img SRC="leftg.gif" ALT="Previous" BORDER=0 height=30 width=30></a><a href="prg-c05.htm"><img SRC="rightg.gif" ALT="Next" BORDER=0 height=30 width=30></a><a href="prg-c01.htm"><img SRC="upg.gif" ALT="Up" BORDER=0 height=30 width=30></a><a href="prg-c.htm"><img SRC="topg.gif" ALT="Index" BORDER=0 height=30 width=30></a><a href="prg-c_c.htm"><img SRC="contg.gif" ALT="Contents" BORDER=0 height=30 width=30></a>
<hr size="1" width="100%">
<h3>
FEEDBACK &amp; COPYRIGHT</h3>

<table BORDER=4 >
<tr>
<td>J'ai investi beaucoup d'&eacute;nergie et beaucoup de temps dans la
r&eacute;daction de ce cours. C'est
avec un grand plaisir que je constate que des milliers d'int&eacute;ress&eacute;s
ont visit&eacute; le site web et des milliers ont t&eacute;l&eacute;charg&eacute;
le cours depuis sa publication en ao&ucirc;t 1996.&nbsp;
<p>Le tutoriel a connu un tel succ&egrave;s que je re&ccedil;ois chaque
semaine un nombre croissant de messages &agrave; ce sujet. Bien s&ucirc;r
je m'en r&eacute;jouis, mais malheureusement, il ne m'est pas possible
de r&eacute;pondre &agrave; tous les messages, ni de m'occuper de la r&eacute;solution
des probl&egrave;mes et des appels &agrave; l'aide qui me sont envoy&eacute;s
 <b>:-(</b>
<br><font color="#990000">Ainsi, je prie mes lecteurs de m'envoyer uniquement
des messages concernant vraiment le contenu du tutoriel!&nbsp;</font>
Je vous remercie d'avance de votre compr&eacute;hension!
<p><font color="#660000">Vous trouverez les r&eacute;ponses &agrave; la plupart des questions concernant ce tutoriel ou la programmation en ANSI-C, dans ma <b>page </b></font><b><a href="prg-c03.htm">FAQ</a></b><font color="#660000">
ou dans les pages qui y sont mentionn&eacute;es.</font></td>
</tr>

<tr ALIGN=CENTER>
<td>
<table WIDTH="80%" >
<tr ALIGN=CENTER>
<td ALIGN=CENTER><b>Contact Internet:</b></td>

<td ALIGN=LEFT><b>voir <A HREF="http://www.ltam.lu/fabfr/" target="_parent">'Carte de visite online'</A></b></td>
</tr>
</table>
&nbsp;</td>
</tr>

<tr>
<td>Si vous voulez vous revancher de fa&ccedil;on plus mat&eacute;rielle,
vous pouvez envoyer une somme d'argent qui vous semble appropri&eacute;e
par PayPal, sous forme d'un ch&egrave;que ou sous forme de billets d'argent &agrave;
mon adresse de contact.&nbsp;
<br><b>A la fin de chaque ann&eacute;e, je prends soin de virer l'ensemble
de l'argent ainsi re&ccedil;u &agrave; l'organisation <a href="http://www.aei-ong.lu" target="_parent">Aide
&agrave; l'Enfance de l'Inde</a></b> - une organisation non gouvernementale
luxembourgeoise qui s'est sp&eacute;cialis&eacute;e &agrave; appuyer des
projets de d&eacute;veloppement villageois int&eacute;gr&eacute; en Inde
-&nbsp;</td>
</tr>

<tr ALIGN=CENTER>
<td>
<table WIDTH="80%" >
<tr ALIGN=CENTER>
<td ALIGN=CENTER><b>Adresse de contact:</b></td>

<td ALIGN=LEFT>Lyc&eacute;e Technique des Arts et M&eacute;tiers&nbsp;
<br>c/o Fr&eacute;d&eacute;ric Faber&nbsp;
<br>19, rue Guillaume Schneider&nbsp;
<br>L-2522 Luxembourg&nbsp;
<br>G-D. de Luxembourg (EU)&nbsp;</td>
</tr>
</table>
&nbsp;</td>
</tr>
</table>

<p>
<hr size="1" width="100%"><b><font color="#FF0000">! ! ! A T T E N T I
O N ! ! !</font></b>
<p>Tous les fichiers qui font partie de ce cours/manuel ainsi que ceux
qui contiennent les solutions des exercices du cours sont disponibles comme
<i>'FREEWARE',
</i>mais
l'auteur se r&eacute;serve les droits d'auteurs et tous les autres droits:
<br>&nbsp;
<ul>
<li>
<b>Vous n'avez PAS le droit de mettre en circulation cette oeuvre en entier
ou en partie pour en tirer un profit commercial quelconque.</b></li>

<br>&nbsp;
<li>
<b>Vous n'avez PAS le droit de mettre en circulation une version modifi&eacute;e
ou traduite d'une partie ou de l'ensemble de l'oeuvre, pour en tirer un
profit commercial quelconque.</b></li>

<br>&nbsp;
<li>
<b>Vous n'avez PAS le droit de mettre en circulation cette oeuvre en entier
ou en partie sans faire une r&eacute;f&eacute;rence bien visible au site original (c.-&agrave;-d.: <a href="http://www.ltam.lu/Tutoriel_Ansi_C" target="_Parent">http://www.ltam.lu/Tutoriel_Ansi_C</a>) et &agrave; l'auteur original (c.-&agrave;-d. <a href="http://www.ltam.lu/fabfr" target="_Parent">Fred Faber - http://www.ltam.lu/fabfr</a>).</b><br>


</li>



<br>&nbsp;</ul>

<p><b><font color="#FF0000">REMARQUE IMPORTANTE:</font></b></p>
Sur Internet il existe un certain nombre de copies de mon tutoriel, mais malheureusement ces copies ne sont en g&eacute;n&eacute;ral plus actuelles. Je re&ccedil;ois donc des messages sur des probl&egrave;mes longtemps r&eacute;solus ou des liens qui ne fonctionnent pas - sur les sites copi&eacute;s... Je vous prie donc : <br>
 <p>
<font color="#880000"><b>Au lieu de publier le site autre part, veuillez faire un lien sur le site original!</b></font> </p>
Notre serveur et notre connexion vers l'Internet suffisent amplement pour satisfaire la demande  et au cours des 10 derni&egrave;res ann&eacute;es le serveur &eacute;tait 'offline' au total un maximum de deux ou trois jours et ceci pour des raisons de maintenance. <br>

<hr size="1" width="100%"><a href="prg-c03.htm"><img SRC="leftg.gif" ALT="Previous" BORDER=0 height=30 width=30></a><a href="prg-c05.htm"><img SRC="rightg.gif" ALT="Next" BORDER=0 height=30 width=30></a><a href="prg-c01.htm"><img SRC="upg.gif" ALT="Up" BORDER=0 height=30 width=30></a><a href="prg-c.htm"><img SRC="topg.gif" ALT="Index" BORDER=0 height=30 width=30></a><a href="prg-c_c.htm"><img SRC="contg.gif" ALT="Contents" BORDER=0 height=30 width=30></a>
<br>
<hr size="1" width="100%"><small><a href="prg-c04.htm">Feedback
- Copyright &copy;</a> 1993,1996,1997,2011 <a href="prg-c02.htm">F.Faber</a></small>
</body>
</html>
